export default [
  {
    '参数': 'modelValue',
    '说明': '绑定值（单选时为单个值，多选时为数组）',
    '类型': '`any | any[]`',
    '默认值': '-'
  },
  {
    '参数': 'multiple',
    '说明': '是否支持多选',
    '类型': '`boolean`',
    '默认值': '`false`'
  },
  {
    '参数': 'mandatory',
    '说明': '是否必须选中一个',
    '类型': '`boolean`',
    '默认值': '`false`'
  },
  {
    '参数': 'column',
    '说明': '是否垂直排列',
    '类型': '`boolean`',
    '默认值': '`false`'
  },
  {
    '参数': 'filter',
    '说明': '是否在选中时显示过滤图标',
    '类型': '`boolean`',
    '默认值': '`false`'
  }
]
