export default [
  {
    '参数': 'vertical',
    '说明': '是否为垂直分割线',
    '类型': '`boolean`',
    '默认值': '`false`'
  },
  {
    '参数': 'inset',
    '说明': '是否使用内嵌样式（左侧有内边距）',
    '类型': '`boolean`',
    '默认值': '`false`'
  },
  {
    '参数': 'length',
    '说明': '分割线长度',
    '类型': '`string | number`',
    '默认值': '-'
  },
  {
    '参数': 'thickness',
    '说明': '分割线粗细',
    '类型': '`string | number`',
    '默认值': '-'
  },
  {
    '参数': 'color',
    '说明': '分割线颜色',
    '类型': '`string`',
    '默认值': '-'
  },
  {
    '参数': 'opacity',
    '说明': '分割线透明度',
    '类型': '`string | number`',
    '默认值': '-'
  }
]
