export default [
  {
    '插槽名': 'prepend',
    '说明': '前置内容',
    '作用域参数': '-'
  },
  {
    '插槽名': 'append',
    '说明': '后置内容',
    '作用域参数': '-'
  },
  {
    '插槽名': 'prepend-inner',
    '说明': '内部前置内容',
    '作用域参数': '-'
  },
  {
    '插槽名': 'append-inner',
    '说明': '内部后置内容',
    '作用域参数': '-'
  },
  {
    '插槽名': 'item',
    '说明': '自定义选项',
    '作用域参数': '`{ item, index, props }`'
  },
  {
    '插槽名': 'selection',
    '说明': '自定义选中项',
    '作用域参数': '`{ item, index }`'
  },
  {
    '插槽名': 'no-data',
    '说明': '无数据内容',
    '作用域参数': '-'
  }
]